["{\"qustion_output\": \"<CLS>Doctor, I have a lump in my neck and another one in my shoulder. Also, my ears have been very itchy lately.<SEP>The extracted entities are Lump in neck, Lump in shoulder, Itchy ears<EOS>\", \"answer_output\": \"<CLS>Based on the symptoms you've described, it's possible that you have lymphoma. I would like to do some tests to confirm the diagnosis.<SEP>The extracted entities are lymphoma, diagnostic tests<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Hi doctor, I've been experiencing vaginal itching and discharge lately. Also, I had a recent pregnancy. Can you tell me what's wrong with me?<SEP>The extracted entities are Vaginal itching, Vaginal discharge, Pregnancy<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms and recent pregnancy, it seems like you might be experiencing genital herpes. I recommend scheduling an appointment to get tested and discuss treatment options.<SEP>The extracted entities are Genital herpes, Pregnancy, Appointment scheduling, Testing, Treatment options<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I've been feeling a lot of anxiety and nervousness lately, along with some abnormal involuntary movements. And sometimes I get very low and experience depressive or psychotic symptoms. What could be wrong with me?<SEP>The extracted entities are Anxiety, Nervousness, Abnormal involuntary movements, Low mood, Depressive symptoms, Psychotic symptoms<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it's possible that you have anxiety disorder. We can conduct some tests and evaluations to confirm the diagnosis, and then discuss treatment options.<SEP>The extracted entities are Anxiety disorder, Diagnostic tests and evaluations, Treatment options<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Hi doctor, I think I might have chlamydia. <SEP>The extracted entities are Chlamydia infection<EOS>\", \"answer_output\": \"<CLS>Okay, to confirm that, we'll need to perform a chlamydia test. Additionally, we'll need to do a urinalysis, a pelvic exam, and a microscopic examination, which includes a bacterial smear, culture, and toxicology. We'll also need to perform an HIV screen and a standard pregnancy test. Lastly, we'll conduct an examination of your breasts.<SEP>The extracted entities are Chlamydia test, Urinalysis, Pelvic exam, Microscopic examination, Bacterial smear, Bacterial culture, Bacterial toxicology, HIV screen, Standard pregnancy test, Breast examination<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I've been having severe headaches and I recently had a blackout. The doctors at the emergency room told me that I have an intracerebral hemorrhage. What tests do I need to take?<SEP>The extracted entities are Severe headaches, Blackout, Intracerebral hemorrhage, Diagnostic tests<EOS>\", \"answer_output\": \"<CLS>Alright. We need to perform some tests to assess your condition properly. First, we need to do a radiographic imaging procedure to locate and assess the damage caused by the hemorrhage. We also need to do a CT scan to have a more detailed image of the hemorrhage. Additionally, we need to take a blood test to check if there is anemia or if you have abnormal blood clotting. A complete blood count is necessary to look into your red blood cells, white blood cells, and platelets. An electrocardiogram will also be conducted to evaluate your heart's health, as this may have caused the hemorrhage in the first place. Finally, we need to monitor your fluid intake. We may have to administer intravenous fluid replacement to keep your fluid and electrolyte balance stable.<SEP>The extracted entities are Radiographic imaging procedure, Location of hemorrhage, CT scan, Detailed image of hemorrhage, Blood test, Abnormal blood clotting, Complete blood count, Red blood cells, White blood cells, Platelets, Electrocardiogram, Heart's health, Intravenous fluid replacement, Fluid and electrolyte balance<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I'm having difficulty speaking and also experiencing incontinence of stool. What could be the problem?<SEP>The extracted entities are Difficulty speaking and Incontinence of stool<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, you may be suffering from Decubitus ulcer. It's a type of skin ulcer that arises as a result of continuous pressure on one area.<SEP>The extracted entities are Decubitus ulcer, Skin ulcer, Continuous pressure<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing knee weakness and swelling. It is affecting my daily activities and I am unable to walk properly.<SEP>The extracted entities are Knee weakness, Knee swelling, Difficulty walking<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it seems like you may be suffering from Osteochondrosis. It is a condition where the bone and cartilage in a joint break down, causing pain, weakness, and swelling in the affected area.<SEP>The extracted entities are Osteochondrosis, Bone and cartilage breakdown, Joint pain, Weakness, Swelling<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been drinking a lot lately and I find myself getting angry much more quickly than usual. What could be causing this?<SEP>The extracted entities are Alcohol abuse, Anger, Behavioral symptoms, Irritability<EOS>\", \"answer_output\": \"<CLS>It sounds like you may be experiencing symptoms of depression. Abusing alcohol and having excessive anger are common symptoms of depression. It is important that we discuss your mental health and come up with a treatment plan.<SEP>The extracted entities are depression, alcohol abuse, excessive anger<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Hi Doctor, I think I might have a pilonidal cyst. It's been really painful and uncomfortable lately.<SEP>The extracted entities are Pilonidal cyst, Pain, Discomfort<EOS>\", \"answer_output\": \"<CLS>I'm sorry to hear that. In order to treat a pilonidal cyst, I'm going to prescribe you some medications. You will need to take Clindamycin orally and apply Miconazole Topical Product, Betamethasone-Clotrimazole Topical and Silver Nitrate Topical each locally. Additionally, you can soak in a sitz bath with Magnesium Sulfate and Sodium Hypochlorite Topical solution. Take Isosorbide Dinitrate to relieve the pain. Antibiotics such as Quinidine, Clavulanate (Augmentin), Linezolid (Zyvox), and Dicloxacillin may also be prescribed as needed depending on individual case.<SEP>The extracted entities are Pilonidal cyst, Clindamycin, Miconazole Topical Product, Betamethasone-Clotrimazole Topical, Silver Nitrate Topical, Magnesium Sulfate, Sodium Hypochlorite Topical solution, Isosorbide Dinitrate, Quinidine, Clavulanate (Augmentin), Linezolid (Zyvox), Dicloxacillin, Pain relief\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I've been having trouble getting erections lately. It seems like my penis has become smaller and I'm not sure why.<SEP>The extracted entities are Trouble getting erections, Decreased penis size.<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, I recommend a complete physical skin exam performed, as well as a urinalysis. Additionally, we may need to perform an excision or other procedures on the urethra. There may be other therapeutic procedures we can consider, such as indwelling catheter placement or other procedures on the male genital area.<SEP>The extracted entities are Complete physical skin exam, Urinalysis, Urethral excision or other procedures, Indwelling catheter placement, Other procedures on male genital area<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been feeling low for the past few months. I think I may have dysthymic disorder.<SEP>The extracted entities are Feeling low, Dysthymic disorder<EOS>\", \"answer_output\": \"<CLS>I see. I would recommend medications such as Escitalopram (Lexapro), Fluoxetine (Prozac), Bupropion (Wellbutrin), Clonazepam, Citalopram (Celexa), Paroxetine (Paxil), Venlafaxine (Effexor), Buspirone (Buspar), Atomoxetine (Strattera), Doxepin, Desvenlafaxine (Pristiq), or even Darunavir (Prezista) to help manage your symptoms.<SEP>The extracted entities are Escitalopram (Lexapro), Fluoxetine (Prozac), Bupropion (Wellbutrin), Clonazepam, Citalopram (Celexa), Paroxetine (Paxil), Venlafaxine (Effexor), Buspirone (Buspar), Atomoxetine (Strattera), Doxepin, Desvenlafaxine (Pristiq), Darunavir (Prezista)<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been having difficulty breathing and I feel like I'm suffocating. I was recently diagnosed with acute respiratory distress syndrome (ARDS). What medications do I need to take?<SEP>The extracted entities are Difficulty breathing, Feeling of suffocation, Acute respiratory distress syndrome (ARDS), Medications<EOS>\", \"answer_output\": \"<CLS>Based on your condition, you will need to take Methylprednisolone (Medrol), Levofloxacin (Levaquin), Midazolam (Versed), Propofol, Ipratropium, Zosyn, dopamine, Vancomycin, Combivent, Vecuronium, Oxygen, and Moxifloxacin (Avelox). These medications will help reduce inflammation, fight any infections, and support your breathing. Please make sure to take them as prescribed and come back for a follow-up appointment.<SEP>The extracted entities are Methylprednisolone (Medrol), Levofloxacin (Levaquin), Midazolam (Versed), Propofol, Ipratropium, Zosyn, dopamine, Vancomycin, Combivent, Vecuronium, Oxygen, and Moxifloxacin (Avelox), Inflammation reduction, Infection fighting, Breathing support<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing painful menstruation and dizziness, what could be the problem?<SEP>The extracted entities are Painful menstruation, Dizziness<EOS>\", \"answer_output\": \"<CLS>It sounds to me like you might be suffering from a tension headache.<SEP>The extracted entities are Tension headache<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing muscle stiffness and tightness, along with a pale complexion. What could be the reason for this?<SEP>The extracted entities are Muscle stiffness, Muscle tightness, Pale complexion<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it could be that you have leukemia. It is a blood cancer that causes abnormal white blood cells to grow and interfere with the normal functioning of other blood cells, which can lead to muscle stiffness or tightness, as well as pallor. We will need to perform some tests to confirm the diagnosis.<SEP>The extracted entities are Leukemia, Blood cancer, Abnormal white blood cells, Muscle stiffness, Muscle tightness, Pallor, Diagnostic tests<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I am experiencing some issues like difficulty in swallowing, hoarse voice, and a lump in my throat. Also, my neck is swelling up, and my hearing seems to have diminished. What could this be?<SEP>The extracted entities are Difficulty swallowing, Hoarse voice, Lump in throat, Swelling of neck, Diminished hearing<EOS>\", \"answer_output\": \"<CLS>Based on the symptoms you have described, it is possible that you may have a thyroid nodule. A thyroid nodule is a solid or fluid-filled lump that forms within the thyroid gland, which is located in your neck. This can cause various symptoms, including the ones you have mentioned.<SEP>The extracted entities are Thyroid nodule, Solid or fluid-filled lump, Thyroid gland, Neck, Various symptoms<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Hi doctor, I've been feeling hot and cold lately along with some elbow cramps or spasms. I also feel like vomiting sometimes and have had seizures in the past. What could be the reason for these symptoms? <SEP>The extracted entities are Hot and cold sensation, Elbow cramps or spasms, Nausea, Seizures<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it seems like you could be suffering from cysticercosis, which is a parasitic infection caused by tapeworm eggs. It can affect different parts of the body and cause a range of symptoms, such as seizures, cramps, and vomiting. We'll need to run some tests to confirm the diagnosis and start treatment right away.<SEP>The extracted entities are Cysticercosis, Parasitic infection, Tapeworm eggs, Seizures, Cramps, Vomiting, Diagnostic tests, Treatment<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Hi doctor, I've been experiencing a lot of pain and swelling in my ankle. I don't remember injuring it, but it's been bothering me for a few days now.<SEP>The extracted entities are Ankle pain, Ankle swelling<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it's possible that you have a fracture of the ankle. I recommend getting an X-ray and evaluation to confirm the diagnosis and determine the appropriate treatment.<SEP>The extracted entities are Fracture of the ankle, X-ray imaging, Evaluation<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing conduct disorder symptoms. I have trouble controlling my anger and often have outbursts of aggression.<SEP>The extracted entities are Conduct disorder symptoms, Trouble controlling anger, Outbursts of aggression<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, I recommend that you take medications like Risperidone, Methylphenidate, Adderall, Aripiprazole (Abilify), Haloperidol, Atomoxetine (Strattera), Dexmethylphenidate (Focalin), Desmopressin, Guanfacine (Intuniv), Lisdexamfetamine (Vyvanse), Valproic Acid, and Zonisamide. However, I will have to assess your condition and medical history first before prescribing a medication.<SEP>The extracted entities are Risperidone, Methylphenidate, Adderall, Aripiprazole (Abilify), Haloperidol, Atomoxetine (Strattera), Dexmethylphenidate (Focalin), Desmopressin, Guanfacine (Intuniv), Lisdexamfetamine (Vyvanse), Valproic Acid, Zonisamide<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been having a lot of joint pain in my arm and wrist lately. It's starting to really bother me. What do you think it could be?<SEP>The extracted entities are Joint pain, Arm pain, Wrist pain<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it sounds like you may be suffering from lateral epicondylitis or tennis elbow. This is a condition that causes pain in the lateral or outer part of the elbow and can also affect the wrist and arm.<SEP>The extracted entities are Lateral epicondylitis, Tennis elbow, Pain in elbow, Pain in wrist, Pain in arm<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have an issue with my leg. It's been swelling up and it's been really hard to walk. Also, I can't seem to feed my infant properly.<SEP>The extracted entities are Leg swelling, Difficulty walking, Feeding difficulty<EOS>\", \"answer_output\": \"<CLS>Well, it sounds like you have an injury to your leg. The difficulty in feeding your infant might be due to the pain and discomfort caused by the swelling. It's important to have the leg examined and treated as soon as possible to prevent further complications.<SEP>The extracted entities are Leg injury, Swelling, Pain, Discomfort, Feeding difficulty<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I was diagnosed with congenital rubella. What medical tests do I need to undergo?<SEP>The extracted entities are congenital rubella, medical tests<EOS>\", \"answer_output\": \"<CLS>You need to undergo a corneal transplant.<SEP>The extracted entities are Corneal transplant<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have some symptoms that have been troubling me. I have problems with my eye and it is swollen. Additionally, my knee feels weak.<SEP>The extracted entities are Eye problems, Swollen eye, Weak knee<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, you may have an open wound of the eye. We should get you to an ophthalmologist as soon as possible to further examine your eye and determine the best course of action to treat your injury.<SEP>The extracted entities are Open wound of the eye, Ophthalmologist visit, Eye examination<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing fainting spells lately. Can you tell me what could be wrong?<SEP>The extracted entities are Fainting spells, Medical condition<EOS>\", \"answer_output\": \"<CLS>It could be due to sinus bradycardia. Have you experienced any other symptoms such as dizziness or shortness of breath?<SEP>The extracted entities are Sinus bradycardia, Dizziness, Shortness of breath<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing hot flashes along with headaches. What could be wrong with me?<SEP>The extracted entities are Hot flashes, Headaches<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it seems like you could be suffering from a pituitary disorder. We'll need to run some tests to confirm this diagnosis.<SEP>The extracted entities are Pituitary disorder, Diagnostic tests<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, my hands and fingers have become weak and I have been experiencing joint swelling and wrist pain. What could be the issue with me?<SEP>The extracted entities are Weakness in hands and fingers, Joint swelling, Wrist pain<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it seems like you might be suffering from rheumatoid arthritis.<SEP>The extracted entities are Rheumatoid arthritis<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I've been experiencing a fever, difficulty breathing, ache all over and weakness. What could be the problem?<SEP>The extracted entities are Fever, Difficulty breathing, Aches, Weakness<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, you might be having myocarditis. Myocarditis is the inflammation of the heart muscle caused by a viral, bacterial or fungal infection.<SEP>The extracted entities are Myocarditis, Inflammation of heart muscle, Viral infection, Bacterial infection, Fungal infection<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing ringing in my ear, dizziness, ear pain, sweating, and weakness. What could be wrong with me?<SEP>The extracted entities are Ringing in ear, Dizziness, Ear pain, Sweating, Weakness<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it sounds like you may be experiencing labyrinthitis. This is an inner ear disorder that can cause all of the symptoms you described. I would recommend a further evaluation to confirm the diagnosis and determine the best course of treatment.<SEP>The extracted entities are Labyrinthitis, Inner ear disorder, Diagnosis, Treatment<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing abnormal vaginal discharge. It's not itchy or painful, just a bit concerning. <SEP>The extracted entities are Abnormal vaginal discharge<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, I would prescribe you a combination of medications. Your medications will include metronidazole, fluconazole (Diflucan), and metronidazole topical product.<SEP>The extracted entities are Metronidazole, Fluconazole (Diflucan), Metronidazole topical product<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been having sharp chest pain. What could be the reason for this?<SEP>The extracted entities are Chest pain, Sharp pain<EOS>\", \"answer_output\": \"<CLS>Based on what you have said, it's possible that you are experiencing a heart attack.<SEP>The extracted entities are Heart attack<EOS>\"}\n", "{\"qustion_output\": \"<CLS>I have been diagnosed with Hemochromatosis, what medications do I need to take?<SEP>The extracted entities are Hemochromatosis, Medications<EOS>\", \"answer_output\": \"<CLS>You will need to take Deferasirox (Exjade), Folic Acid, Levalbuterol (Xopenex), Spironolactone, Hydroxychloroquine (Plaquenil), Azathioprine, Epoetin Alfa (Procrit), Propranolol, Hydroxyurea, Etanercept (Enbrel), and Glucosamine to manage Hemochromatosis.<SEP>The extracted entities are Deferasirox (Exjade), Folic Acid, Levalbuterol (Xopenex), Spironolactone, Hydroxychloroquine (Plaquenil), Azathioprine, Epoetin Alfa (Procrit), Propranolol, Hydroxyurea, Etanercept (Enbrel), Glucosamine, Hemochromatosis<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing an ache all over my lower abdomen and there seems to be a mass in my scrotum, what could be the problem?<SEP>The extracted entities are Abdominal ache, Scrotal mass<EOS>\", \"answer_output\": \"<CLS>It sounds like you may have an inguinal hernia. An inguinal hernia occurs when tissue, such as part of the intestine, protrudes through a weak spot in the abdominal muscles into the groin or scrotum. It's important to get this checked out and possibly treated with surgery.<SEP>The extracted entities are Inguinal hernia, Tissue, Intestine, Abdominal muscles, Groin, Scrotum, Surgery<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing leg stiffness or tightness lately. What could be the reason for this?<SEP>The extracted entities are Leg stiffness, Leg tightness, Medical condition causing leg stiffness or tightness<EOS>\", \"answer_output\": \"<CLS>Well, it could be a symptom of hypothermia, especially if you have been exposed to cold temperatures for extended periods of time. Have you been feeling unusually cold recently?<SEP>The extracted entities are Hypothermia, Feeling unusually cold<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing seizures and my infant seems very irritable. Also, I am having some disturbance of memories. Can you please help me with this?<SEP>The extracted entities are Seizures, Irritability in infant, Disturbance of memories<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it seems like you have a subdural hemorrhage, which is a type of bleeding in the brain. This can lead to seizures and disturbances in memory. It is important to seek immediate medical attention as this can be a life-threatening condition.<SEP>The extracted entities are Subdural hemorrhage, Bleeding in the brain, Seizures, Disturbances in memory, Life-threatening condition<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been diagnosed with Turner syndrome. What medications do I need to take?<SEP>The extracted entities are Turner syndrome, Medications<EOS>\", \"answer_output\": \"<CLS>You will need to take Somatropin to stimulate growth and development. You will also need to take Sulfamethoxazole to prevent infections, Pimecrolimus Topical to treat skin conditions, and Hyoscyamine to manage stomach and intestinal problems. Additionally, you will need to take Ortho Cyclen as a contraceptive, Carbamazepine to control seizures, Ascorbic Acid to support your immune system, Nystatin Topical Product to treat yeast infections, Phenazopyridine to manage urinary tract symptoms, and Nifedipine to treat high blood pressure.<SEP>The extracted entities are Somatropin, Sulfamethoxazole, Pimecrolimus Topical, Hyoscyamine, Ortho Cyclen, Carbamazepine, Ascorbic Acid, Nystatin Topical Product, Phenazopyridine, Nifedipine<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing rectal bleeding, flatulence, dizziness, symptoms in my eyes, and extreme fatigue. What could be wrong with me?<SEP>The extracted entities are Rectal bleeding, Flatulence, Dizziness, Eye symptoms, Extreme fatigue<EOS>\", \"answer_output\": \"<CLS>Based on those symptoms, it's possible that you have primary thrombocythemia.<SEP>The extracted entities are Primary thrombocythemia<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I think I may have accidentally ingested too many opioids. I'm feeling very nauseous and dizzy. <SEP>The extracted entities are Opioid overdose, Nausea, Dizziness<EOS>\", \"answer_output\": \"<CLS>I'm sorry to hear that. Based on your symptoms and your history of opioid use, I recommend we run some medical tests such as a complete blood count (CBC), kidney function tests (KFTs), and a urinalysis. We will also need to administer intravenous fluid replacement and perform an electrocardiogram (ECG) to assess your heart function. In addition, it would be helpful to do a radiographic imaging procedure, just to make sure there are no further complications. Patient: Okay, that sounds good. Let's get started with those tests right away.<SEP>The extracted entities are complete blood count (CBC), kidney function tests (KFTs), urinalysis, intravenous fluid replacement, electrocardiogram (ECG), radiographic imaging procedure<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I've been feeling faint, having headaches, feeling dizzy and ill. What could be wrong?<SEP>The extracted entities are Fainting, Headaches, Dizziness, Illness<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it sounds like you may have benign paroxysmal positional vertigo (BPPV).<SEP>The extracted entities are Benign paroxysmal positional vertigo (BPPV)<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Hi doctor, I have been experiencing chronic pain and fatigue all over my body. I have been diagnosed with fibromyalgia. What medications would you prescribe for this condition?<SEP>The extracted entities are Chronic pain, Fatigue, Fibromyalgia, Medications<EOS>\", \"answer_output\": \"<CLS>I would recommend a combination of Pregabalin (Lyrica), Nortriptyline, and Milnacipran (Savella) to help with the pain and fatigue. In addition, Chlorzoxazone can be used for muscle spasms and Tizanidine can help with sleep. If you experience migraines, I suggest you try Naratriptan (Amerge) or Ergotamine. Rifaximin can help with irritable bowel syndrome, and for dry mouth, I would prescribe Cevimeline (Evoxac) or Clemastine (Tavist).<SEP>The extracted entities are Pregabalin (Lyrica), Nortriptyline, Milnacipran (Savella), Chlorzoxazone, Tizanidine, Naratriptan (Amerge), Ergotamine, Rifaximin, Cevimeline (Evoxac), Clemastine (Tavist)<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I've been experiencing swelling in my hands and ankle as well as pain in my fingers. Do you have any idea what could be the problem?<SEP>The extracted entities are Swelling in hands, Swelling in ankles, Pain in fingers<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it seems that you may have gout. This is a common type of arthritis that occurs when there is a build-up of uric acid crystals in the joints, causing inflammation and pain. Patient: What do I need to do to treat it?<SEP>The extracted entities are Gout, Arthritis, Uric acid crystals, Inflammation, Pain, Treatment<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I've been experiencing vomiting blood and I also have a history of alcohol abuse. What could be causing this?<SEP>The extracted entities are Vomiting blood, Alcohol abuse, Possible causes<EOS>\", \"answer_output\": \"<CLS>It seems that you may be experiencing symptoms of Wernicke Korsakoff syndrome, which is often caused by long-term alcohol abuse. It's important that you seek medical attention immediately.<SEP>The extracted entities are Wernicke Korsakoff syndrome, Long-term alcohol abuse, Medical attention<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Hi doctor, I've been experiencing some symptoms that are troubling me. My eyes feel heavy, and I seem to have some difficulty focusing. Additionally, I feel like there's some fluid buildup in my ear. What could be causing this?<SEP>The extracted entities are Eye heaviness, Difficulty focusing, Fluid buildup in ear<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it sounds like you have tinnitus of unknown cause.<SEP>The extracted entities are Tinnitus<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing some unusual symptoms lately. I have been facing wrist weakness, leg pain, and elbow cramps or spasms. What could be the reason for this?<SEP>The extracted entities are Wrist weakness, Leg pain, Elbow cramps, Elbow spasms<EOS>\", \"answer_output\": \"<CLS>These symptoms might be due to Pulmonic valve disease. It's a condition in which there's an issue with the valve that separates the heart from the lungs, leading to difficulties in blood flow. We'll have to conduct further tests to confirm the diagnosis.<SEP>The extracted entities are Pulmonic valve disease, Valve issue, Difficulties in blood flow<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, my neck is hurting a lot and my skin is irritated. Also, my skin looks abnormal and it's really itchy. I have a rash on my skin too. What could be wrong with me? <SEP>The extracted entities are Neck pain, Skin irritation, Abnormal skin appearance, Itching, Rash<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it appears that you have intertrigo, which is a skin condition that causes redness, itching, and skin rashes in areas where skin rubs against skin or clothing, like the neck.<SEP>The extracted entities are intertrigo, skin rash, redness, itching, neck<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been having vomiting, low back pain, decreased appetite, back pain, and blood in my urine. What could be the reason for these symptoms? <SEP>The extracted entities are Vomiting, Low back pain, Decreased appetite, Blood in urine<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it sounds like you may have a benign kidney cyst, which is a fluid-filled sac that can form on your kidney causing pain and discomfort, as well as nausea and blood in your urine.<SEP>The extracted entities are Benign kidney cyst, Fluid-filled sac, Kidney pain and discomfort, Nausea, Blood in urine<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I've been feeling really off lately and I think it might have something to do with a hormone disorder.<SEP>The extracted entities are Hormone disorder, Feeling off<EOS>\", \"answer_output\": \"<CLS>Okay, based on your symptoms and diagnosis, I am going to prescribe you with Leuprolide, Phentermine, Estradiol, Progesterone, Testosterone, Mitotane, Histrelin, Fludrocortisone, Chlorhexidine Topical, Phendimetrazine, Gemcitabine, and Minocycline.<SEP>The extracted entities are Leuprolide, Phentermine, Estradiol, Progesterone, Testosterone, Mitotane, Histrelin, Fludrocortisone, Chlorhexidine Topical, Phendimetrazine, Gemcitabine, Minocycline<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Hi doctor. I have been feeling very uneasy lately. I have these repetitive thoughts and behaviors that I just can't seem to control. I think I might have OCD. <SEP>The extracted entities are Obsessive-compulsive disorder (OCD), Repetitive thoughts, Repetitive behaviors<EOS>\", \"answer_output\": \"<CLS>Yes, it sounds like OCD. I would recommend starting you on a medication called Fluoxetine (Prozac). It's an antidepressant and can help manage the symptoms of OCD.<SEP>The extracted entities are OCD, Fluoxetine (Prozac), Antidepressant<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I'm experiencing symptoms of the kidneys. What could be the possible disease?<SEP>The extracted entities are Kidney symptoms, Possible kidney disease<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it could be related to your diabetes. Diabetes can lead to kidney damage over time, resulting in symptoms such as frequent urination, swelling in the legs, and decreased appetite. It's important to monitor your blood sugar levels and get regular check-ups to prevent such complications.<SEP>The extracted entities are Diabetes, Kidney damage, Frequent urination, Swelling in legs, Decreased appetite, Blood sugar levels, Regular check-ups<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have these weird bumps on my fingers and they won't go away. <SEP>The extracted entities are Fingers, Bumps<EOS>\", \"answer_output\": \"<CLS>It sounds like you may have viral warts.<SEP>The extracted entities are Viral warts<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Hi Doctor, I've been feeling quite unwell for the past few days. I have symptoms of flu-like syndrome and tongue lesions. What could be the reason for it?<SEP>The extracted entities are Flu-like syndrome, Tongue lesions<EOS>\", \"answer_output\": \"<CLS>It sounds like you might have a parathyroid adenoma. This is a non-cancerous growth on one of your parathyroid glands that can cause a range of symptoms, including those you are experiencing. I would recommend running some tests to confirm the diagnosis.<SEP>The extracted entities are Parathyroid adenoma, Non-cancerous growth, Symptoms, Diagnostic tests<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, my eye is really bothering me. It's swollen and red.<SEP>The extracted entities are Eye swelling, Eye redness<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, you may have a corneal disorder.<SEP>The extracted entities are corneal disorder<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing a decrease in my vision in one of my eyes. My optometrist mentioned that it could be Amblyopia. What tests do I need to undergo?<SEP>The extracted entities are Decrease in vision in one eye, Amblyopia, Diagnostic tests<EOS>\", \"answer_output\": \"<CLS>For Amblyopia, we will need to perform an ophthalmologic and otologic diagnosis and treatment, an ophthalmic examination and evaluation, as well as other therapeutic procedures on eyelids, conjunctiva, and cornea. We may also perform other therapeutic procedures and diagnostic procedures on your eye to properly diagnose and treat your condition.<SEP>The extracted entities are Amblyopia, Ophthalmologic diagnosis and treatment, Otologic diagnosis and treatment, Ophthalmic examination and evaluation, Therapeutic procedures on eyelids, Therapeutic procedures on conjunctiva, Therapeutic procedures on cornea, Diagnostic procedures on eye<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I've been experiencing diminished vision, abnormal breathing sounds, difficulty eating, and overall fatigue. What could be wrong with me?<SEP>The extracted entities are Diminished vision, Abnormal breathing sounds, Difficulty eating, Fatigue<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it's possible that you have Wilson disease. This is a genetic disorder that causes copper to accumulate in various organs, including the liver and brain. The symptoms you described are common in this condition. I suggest we run some tests to confirm the diagnosis.<SEP>The extracted entities are Wilson disease, Genetic disorder, Copper accumulation, Liver, Brain, Diagnostic tests<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Hi doctor, I have been experiencing vomiting, nasal congestion, wheezing, fever and sharp chest pain. Do you have any idea what is wrong with me?<SEP>The extracted entities are Vomiting, Nasal congestion, Wheezing, Fever, Sharp chest pain<EOS>\", \"answer_output\": \"<CLS>Yes, based on your symptoms, it seems like you might have pneumonia.<SEP>The extracted entities are Pneumonia<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I fell off my bike and injured my trunk. I am experiencing severe pain.<SEP>The extracted entities are Bike accident, Trunk injury, Severe pain. <EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, I would recommend a radiographic imaging procedure to assess the extent of your injury. This may include a plain x-ray, an X-ray computed tomography or a CAT scan of your head. We will also perform a urinalysis and provide intravenous fluid replacement as necessary. Additionally, we will need to manage your wound care.<SEP>The extracted entities are Radiographic imaging procedure, Plain x-ray, X-ray computed tomography, CAT scan of head (Head ct), Urinalysis, Intravenous fluid replacement, Wound care<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing coughing up sputum for the past week. <SEP>The extracted entities are Cough, Sputum<EOS>\", \"answer_output\": \"<CLS>That could be a symptom of a Stricture of the esophagus. (Note: As per the prompt, the conversation was only one back and forth. However, it is important to note that the doctor would inquire more about the patient's symptoms, conduct an exam, and possibly order tests to make a diagnosis.)<SEP>The extracted entities are Stricture of the esophagus<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I've been experiencing foot pain and hand stiffness lately. What could be causing this?<SEP>The extracted entities are Foot pain, Hand stiffness<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it sounds like you may have suffered a crushing injury.<SEP>The extracted entities are Crushing injury<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing low back pain recently.<SEP>The extracted entities are Low back pain<EOS>\", \"answer_output\": \"<CLS>Well, after examining your test results, it seems like you have a benign kidney cyst, which can cause low back pain.<SEP>The extracted entities are Benign kidney cyst, Low back pain<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Hello Doctor, I have been experiencing painful sores in my genital area. I think I might have chancroid.<SEP>The extracted entities are Painful sores, Genital area, Chancroid<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it is possible that you have chancroid. I recommend a course of antibiotics such as Ciprofloxacin and Ibuprofen for pain relief.<SEP>The extracted entities are Chancroid, Antibiotics (Ciprofloxacin), Pain relief (Ibuprofen)<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing premature ventricular contractions (PVCs) recently. What medications do I need to take for it?<SEP>The extracted entities are Premature ventricular contractions (PVCs), Medications<EOS>\", \"answer_output\": \"<CLS>You will need to take Flecainide to treat your PVCs.<SEP>The extracted entities are Flecainide, PVCs (Premature Ventricular Contractions)<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I've been experiencing some pain and swelling in my hands and fingers, can you tell me what could be causing this?<SEP>The extracted entities are Hand pain, Hand swelling, Finger pain, Finger swelling<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it seems like you may have juvenile rheumatoid arthritis, which is a type of arthritis that affects children and young adults.<SEP>The extracted entities are Juvenile rheumatoid arthritis, Arthritis, Children, Young adults<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I've been experiencing lower abdominal pain. Also, I missed my period this month and I'm having trouble conceiving. When I do get my period, it's really painful. What could be wrong with me?<SEP>The extracted entities are Lower abdominal pain, Missed period, Painful periods, Infertility<EOS>\", \"answer_output\": \"<CLS>It seems like you might be suffering from endometriosis. This is a condition where tissue similar to the endometrium, which is normally found inside your uterus, grows outside it. This can cause pain and discomfort, especially during menstruation, and affect your fertility.<SEP>The extracted entities are Endometriosis, Uterus, Menstruation, Fertility<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have a runny nose and there is fluid in my ear. What could be the problem?<SEP>The extracted entities are Runny nose, Fluid in ear<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it sounds like you may have otitis media.<SEP>The extracted entities are Otitis media<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have an open wound on my jaw, and it's not healing properly. What medical tests do I need to take?<SEP>The extracted entities are Open wound on jaw, Poor wound healing<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, we will need to do suturing of the wound immediately. After that, we will need to monitor the wound care management to ensure proper healing. We may also need to conduct an X-ray computed tomography (CT scan) or a CAT scan of your head to see if there is any infection in the jaw bone. Additionally, we will need to do a culture of the wound to determine the type of bacteria that may be present and what antibiotics we should prescribe.<SEP>The extracted entities are Wound suturing, Wound care management, CT scan of head, CAT scan of head (Head ct), Wound culture, Antibiotics prescription<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I've been experiencing joint pain, fatigue, and shortness of breath. What could be the problem?<SEP>The extracted entities are Joint pain, Fatigue, Shortness of breath<EOS>\", \"answer_output\": \"<CLS>Those symptoms can be due to central atherosclerosis, a condition where plaque builds up in the arteries in your heart and restricts blood flow.<SEP>The extracted entities are central atherosclerosis, plaque buildup, arteries, heart, blood flow<EOS>\"}\n", "{\"qustion_output\": \"<CLS>My face has an open wound, and it is quite painful. <SEP>The extracted entities are Open wound, Facial pain<EOS>\", \"answer_output\": \"<CLS>You need to get a Tetanus Toxoid Vaccine (Adacel) to prevent any infection, and we also need to give you Bacitracin (Septa) to apply topically to the wound. Additionally, you can use Povidone Iodine Topical (Betadine) and Chlorhexidine Topical to clean the wound. We'll also use Ketamine to numb the area, Benzoin Topical to help the bandages stick better, and Lidocaine-Tetracaine Topical to keep you comfortable during the procedure. You should also take Clofibrate to reduce any swelling. Finally, we can use Fibrin Sealant Topical to seal the wound, but first, we'll clean it thoroughly with Sterile Water.<SEP>The extracted entities are Tetanus Toxoid Vaccine (Adacel), Bacitracin (Septa), Povidone Iodine Topical (Betadine), Chlorhexidine Topical, Ketamine, Benzoin Topical, Lidocaine-Tetracaine Topical, Clofibrate, Fibrin Sealant Topical, Sterile Water<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing some pain and swelling around my bellybutton. I also noticed some redness and discharge from the area. What could be the problem?<SEP>The extracted entities are Belly button pain, Belly button swelling, Redness around belly button, Discharge from belly button<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it sounds like you might be suffering from omphalitis. To confirm the diagnosis, we will need to perform a complete physical skin exam, as well as culture the wound. In addition, we may need to perform an excision of the skin lesion if it is necessary. We may also need to conduct a rectal examination and wound care management, or other non-OR therapeutic procedures on the skin and breast if required.<SEP>The extracted entities are Omphalitis, Physical skin exam, Culture the wound, Excision of skin lesion, Rectal examination, Wound care management, Other non-OR therapeutic procedures<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have knee weakness and my eye is swollen. <SEP>The extracted entities are Knee weakness, Swollen eye<EOS>\", \"answer_output\": \"<CLS>You have an open wound to your eye, it needs attention immediately. <SEP>The extracted entities are Eye wound, Open wound, Urgent attention needed<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing vomiting and difficulty in swallowing. Do you have any idea what could be causing this?<SEP>The extracted entities are Vomiting, Difficulty swallowing<EOS>\", \"answer_output\": \"<CLS>Yes, these symptoms could be a sign of Erythema multiforme. It is a type of hypersensitivity reaction that causes skin lesions and can also affect the mucous membranes, which can lead to vomiting and difficulty in swallowing.<SEP>The extracted entities are Erythema multiforme, Skin lesions, Mucous membrane involvement, Vomiting, Difficulty swallowing<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Hi doctor, I have been experiencing arm weakness, neck pain and a tingling sensation in my arm.<SEP>The extracted entities are Arm weakness, Neck pain, Tingling sensation in arm<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it seems like you may have a herniated disk. Patient: Oh, what exactly is a herniated disk?<SEP>The extracted entities are Herniated disk (Herniation of intervertebral disc)<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing some emotional symptoms lately. <SEP>The extracted entities are Emotional symptoms<EOS>\", \"answer_output\": \"<CLS>Well, emotional symptoms can be caused by a variety of different conditions. However, in your case, it may be related to VACTERL syndrome.<SEP>The extracted entities are Emotional symptoms, VACTERL syndrome<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I've been experiencing some strange symptoms lately. I keep getting these foot or toe cramps or spasms, and I've been feeling excessively hungry all the time. Additionally, sometimes I have trouble speaking clearly. What do you think could be causing this? <SEP>The extracted entities are Foot or toe cramps or spasms, Excessive hunger, Trouble speaking clearly<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it's possible that you have kidney disease caused by longstanding hypertension. Excessive appetite can be a sign of anemia due to kidney problems, and muscle cramps and difficulty speaking can be caused by electrolyte imbalances that often accompany kidney disease. I would recommend further testing to confirm the diagnosis and develop an appropriate treatment plan.<SEP>The extracted entities are Kidney disease, Hypertension, Excessive appetite, Anemia, Muscle cramps, Difficulty speaking, Electrolyte imbalances, Further testing, Treatment plan<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Hi doctor, I have been experiencing symptoms of a psychotic disorder such as hallucinations and delusions.<SEP>The extracted entities are Psychotic disorder, Hallucinations, Delusions<EOS>\", \"answer_output\": \"<CLS>I'm sorry to hear that. In order to properly diagnose and treat your condition, we will need to conduct a series of medical tests. We will start by arranging psychotherapy and mental health counseling sessions for you. Additionally, we will need to perform a urinalysis, glucose measurement (glucose level), kidney function tests (kidney function test), electrolytes panel, and a toxicology screen. These tests will help us get a better understanding of your current mental and physical health.<SEP>The extracted entities are psychotherapy, Mental health counseling, Urinalysis, Glucose measurement (glucose level), Kidney function tests (Kidney function test), Electrolytes panel, Toxicology screen<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I think I have Chagas disease.<SEP>The extracted entities are Chagas disease<EOS>\", \"answer_output\": \"<CLS>Okay, we need to conduct a plain x-ray (X-ray), radiographic imaging procedure, and a CT scan of your abdomen (Ct of abdomen).<SEP>The extracted entities are Plain x-ray, Radiographic imaging procedure, CT scan of abdomen (Abdominal ct)<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I've been experiencing dizziness, weakness, and leg weakness. What could be causing this?<SEP>The extracted entities are Dizziness,weakness, Leg weakness<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it is possible that you have multiple sclerosis. I recommend we do further tests to confirm the diagnosis.<SEP>The extracted entities are Multiple sclerosis, Further tests<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Hello doctor, I have been having difficulty swallowing and I feel like my food is getting stuck in my throat. I also experience chest pain and heartburn. Do you think something is wrong with my esophagus?<SEP>The extracted entities are Difficulty swallowing, Food getting stuck in throat, Chest pain, Heartburn, Esophagus<EOS>\", \"answer_output\": \"<CLS>It is possible that you have achalasia, which is a disorder that affects the muscles of the esophagus. To confirm this, we would need to do a radiographic imaging procedure such as a barium swallow study or an esophageal manometry test. We will also need to do a plain x-ray, CBC, cardiac enzymes measurement, an electrocardiogram, and kidney function tests to check for any other underlying conditions.<SEP>The extracted entities are Achalasia, disorder, Muscles of the esophagus, Radiographic imaging procedure, Barium swallow study, Esophageal manometry test, Plain x-ray, CBC, Cardiac enzymes measurement, Electrocardiogram, Kidney function tests<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, my skin on my head and neck looks infected and I have a sore in my nose. I also have a skin rash and a cough. Can you tell me what's wrong?<SEP>The extracted entities are Skin infection, Sore in nose, Skin rash, Cough<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it sounds like you have impetigo. It's a bacterial skin infection that is highly contagious.<SEP>The extracted entities are Impetigo, Bacterial skin infection, Contagious<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Hi doctor, I'm experiencing vision problems in my right eye. The eye seems weaker and I'm having a hard time focusing.<SEP>The extracted entities are Vision problems, Right eye weakness, Difficulty focusing<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it sounds like you may have amblyopia. To treat this condition, you will need to use a combination of eye drops, such as atropine, tropicamide ophthalmic, phenylephrine, cyclopentolate ophthalmic, proparacaine ophthalmic, cyclopentolate-phenylephrine ophthalmic, trifluridine ophthalmic, and dexamethasone ophthalmic. Additionally, a fluoride treatment may be prescribed, and lactic acid topical and zolmitriptan can also be used to alleviate any associated symptoms.<SEP>The extracted entities are Amblyopia, Eye drops (atropine, tropicamide ophthalmic, phenylephrine, cyclopentolate ophthalmic, proparacaine ophthalmic, cyclopentolate-phenylephrine ophthalmic, trifluridine ophthalmic, and dexamethasone ophthalmic), Fluoride treatment, Lactic acid topical, Zolmitriptan, Symptoms<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been feeling very weak and fatigued lately. I also have been experiencing confusion and headaches. Can you tell me what is wrong with me?<SEP>The extracted entities are Weakness, Fatigue, Confusion, Headaches<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, you may be experiencing hyponatremia. In order to confirm this diagnosis, we will need to run a series of medical tests. These tests will include hematologic tests, a complete blood count, radiographic imaging procedure, electrolytes panel, glucose measurement, and kidney function tests. Additionally, you may need intravenous fluid replacement.<SEP>The extracted entities are Hyponatremia, Hematologic tests, Complete blood count, Radiographic imaging procedure, Electrolytes panel, Glucose measurement, Kidney function tests, Intravenous fluid replacement<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been feeling really down lately. I also have been experiencing anxiety and nervousness along with disturbance of memory and slurring of words.<SEP>The extracted entities are Down, Anxiety, Nervousness, Memory disturbance, Slurred speech<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, you might be having Dysthymic disorder.<SEP>The extracted entity is Dysthymic disorder<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing wrist pain and I have noticed a lump on my knee. What could be causing this?<SEP>The extracted entities are Wrist pain, Lump on knee<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it is possible that you have Dengue fever. Have you experienced any other symptoms such as fever or headaches?<SEP>The extracted entities are Dengue fever, Fever, Headaches<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing shortness of breath lately. Can you tell me what might be causing it?<SEP>The extracted entities are Shortness of breath, Breathing difficulty, Difficulty breathing<EOS>\", \"answer_output\": \"<CLS>Shortness of breath can be a symptom of anxiety. Have you been feeling anxious or stressed lately?<SEP>The extracted entities are Shortness of breath, Anxiety, Stress<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing frequent headaches lately. <SEP>The extracted entities are Headaches, Frequent headaches<EOS>\", \"answer_output\": \"<CLS>Your blood pressure seems to be high.<SEP>The extracted entities are High blood pressure<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing some symptoms like headaches, warts and redness in my ear. Do you know what could be the problem?<SEP>The extracted entities are Headaches, Warts, Redness in ear<EOS>\", \"answer_output\": \"<CLS>Yes, the disease that might cause these symptoms is Hyperhidrosis. It is a condition characterized by excessive sweating. However, I don't see how headaches, warts, and redness in your ear would be related. Did you notice any other symptoms?<SEP>The extracted entities are: Hyperhidrosis, Excessive sweating<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Hi, doctor. I was recently diagnosed with neuropathy caused by drugs. What medications do I need to take to treat this condition?<SEP>The extracted entities are Neuropathy caused by drugs, Medications for neuropathy treatment<EOS>\", \"answer_output\": \"<CLS>You will need to take either Gabapentin, Pregabalin (Lyrica), Amitriptyline, Pyridostigmine (Mestinon), or a combination of these medications to relieve your neuropathy symptoms.<SEP>The extracted entities are Gabapentin, Pregabalin (Lyrica), Amitriptyline, Pyridostigmine (Mestinon), Neuropathy symptoms<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been feeling stiffness all over my body and also have swollen lymph nodes. I also feel fatigue and have a mass in my neck. What could be wrong with me?<SEP>The extracted entities are Stiffness, Swollen lymph nodes, Fatigue, Mass in neck<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it is possible that you have thyroid cancer. We will need to do some tests to confirm the diagnosis.<SEP>The extracted entities are Thyroid cancer, Diagnosis tests<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing peripheral edema, what could be the reason?<SEP>The extracted entities are Peripheral edema<EOS>\", \"answer_output\": \"<CLS>Well, it could possibly be due to hematoma. Have you experienced any trauma recently?<SEP>The extracted entities are Hematoma, Recent trauma<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I've been having this frontal headache for a few days now and my nose keeps bleeding frequently. What could be wrong? <SEP>The extracted entities are Frontal headache, Frequent nose bleeds<EOS>\", \"answer_output\": \"<CLS>Have you been experiencing any difficulty breathing through your nose or any sense of blockage? These symptoms are indicative of a nasal polyp.<SEP>The extracted entities are difficulty breathing through nose, sense of blockage, nasal polyp<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing excessive growth, loss of sex drive, and hip pain. What could be the reason behind this?<SEP>The extracted entities are Excessive growth, Loss of sex drive, Hip pain<EOS>\", \"answer_output\": \"<CLS>You might be suffering from Reactive arthritis. It is a type of arthritis that causes inflammation in joints, eyes, and the urinary tract.<SEP>The extracted entities are Reactive arthritis, Arthritis, Inflammation, Joints, Eyes, Urinary tract<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing pain and soreness in my breasts, lower abdominal pain, and nausea for a while now, but I haven't had my menstrual period for a few months. What could be wrong with me?<SEP>The extracted entities are Breasts pain, Abdominal pain, Nausea, Amenorrhea (absence of menstrual periods)<EOS>\", \"answer_output\": \"<CLS>It sounds like you may be experiencing the symptoms of amenorrhea, which is the absence of menstruation without a specific cause. It is important to rule out any underlying conditions, such as pregnancy or thyroid problems, with a thorough examination and blood tests.<SEP>The extracted entities are Amenorrhea, Absence of menstruation, Pregnancy, Thyroid problems, Thorough examination, Blood tests<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I am experiencing abdominal pain, bloating, and diarrhea after consuming foods with wheat. I also have a skin rash and feel lethargic. What could be the problem?<SEP>The extracted entities are Abdominal pain, Bloating, Diarrhea, Wheat sensitivity or allergy, Skin rash, Lethargy<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, you might be suffering from celiac disease. To confirm the diagnosis, we'll need to run a series of tests, including hematologic tests, complete blood count, complete physical skin exam performed, biopsy, Hemoglobin A1c measurement, lipid panel, and upper gastrointestinal endoscopy with biopsy.<SEP>The extracted entities are Celiac disease, Hematologic test, Complete blood count, Physical skin exam, Biopsy, Hemoglobin A1c measurement, Lipid panel, Upper gastrointestinal endoscopy with biopsy<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have a mass on my ear, it feels like a small bump.<SEP>The extracted entities are Ear mass, Bump on ear<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it appears that you have a keloid scar on your ear.<SEP>The extracted entities are Keloid scar, Ear<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have noticed a strange growth on my skin, and I have been drinking a lot lately. <SEP>The extracted entities are Skin growth, Excessive drinking<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it is possible that you are suffering from chronic pancreatitis. Your alcohol abuse can cause this disease, and the skin growth can be a result of complications from the condition.<SEP>The extracted entities are Chronic pancreatitis, Alcohol abuse, Skin growth, Complications<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing problems with orgasm, depression, pain during intercourse, impotence and some symptoms of prostate. What could be the reason?<SEP>The extracted entities are Orgasm problems, Depression, Pain during intercourse, Impotence, Symptoms of prostate<EOS>\", \"answer_output\": \"<CLS>It seems that you may be suffering from psychosexual disorder, which can cause all the symptoms that you have described. I recommend that you make an appointment with a mental health professional to discuss your symptoms and explore possible treatments.<SEP>The extracted entities are Psychosexual disorder, Appointment with mental health professional, Symptoms, Possible treatments<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Hi doctor, I've been having some issues lately. I have burning abdominal pain, rectal bleeding and occasional nausea. Do you have any idea what it could be?<SEP>The extracted entities are Abdominal pain (burning), Rectal bleeding, Nausea<EOS>\", \"answer_output\": \"<CLS>Yes, based on your symptoms it seems like you have chronic constipation.<SEP>The extracted entities are Chronic constipation<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been feeling really down lately and I've been drinking a lot. I also find myself feeling anxious and nervous most of the time. <SEP>The extracted entities are Feeling down, Drinking, Anxiety, Nervousness<EOS>\", \"answer_output\": \"<CLS>It sounds like you may be experiencing symptoms of bipolar disorder. Along with depression and anxiety, individuals with this disorder may turn to alcohol abuse as a form of self-medication. It's also common to experience depressive or psychotic symptoms during depressive episodes.<SEP>The extracted entities are Bipolar disorder, Depression, Anxiety, Alcohol abuse, Depressive episodes, Psychotic symptoms<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Hi Doctor, I've been experiencing pain and swelling around my wrist and thumb for the past few days.<SEP>The extracted entities are Pain, Swelling, Wrist, Thumb<EOS>\", \"answer_output\": \"<CLS>It sounds like you may have De Quervain disease. We can prescribe you some medications to help with the pain and inflammation. You will need to take Meloxicam orally and apply Triamcinolone Topical Product and Diclofenac Topical Product at the affected area. You may also need Bupivacaine injection and Estropipate (Ogen) depending on the severity of your symptoms.<SEP>The extracted entities are Meloxicam, Triamcinolone Topical Product, Diclofenac Topical Product, Bupivacaine injection, Estropipate (Ogen), Pain, Inflammation, De Quervain disease<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing an ache all over my body.<SEP>The extracted entities are Ache, Body pain<EOS>\", \"answer_output\": \"<CLS>That could be a sign of hematoma, have you recently experienced any bruising or injury to a specific area?<SEP>The extracted entities are Hematoma, Bruising, Injury<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been feeling very thirsty lately and have also been experiencing some symptoms of the kidneys. Can you tell me what's wrong with me?<SEP>The extracted entities are Thirst, Symptoms of kidneys, Diagnosis or medical tests needed<EOS>\", \"answer_output\": \"<CLS>Based on what you've told me, it sounds like you may be suffering from diabetes. This condition can cause excessive thirst and damage to the kidneys over time.<SEP>The extracted entities are diabetes, excessive thirst, kidney damage. <EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I broke my tooth and it's really hurting. What medication should I take?<SEP>The extracted entities are Tooth pain, Broken tooth<EOS>\", \"answer_output\": \"<CLS>You'll need to take a combination of medications for your pain and to prevent any infection. I'll prescribe antibiotics like Penicillin or Clindamycin to prevent any bacterial infection. You'll also need pain relief medication like Bupivacaine and Benzocaine Topical which will help you in reducing the pain. Finally, I would recommend taking the Acellular Pertussis Vaccine (Adacel) to prevent pertussis infection.<SEP>The extracted entities are Pain relief medication, Antibiotics for bacterial infection prevention, Acellular Pertussis Vaccine (Adacel) for pertussis infection prevention<EOS>\"}\n", "{\"qustion_output\": \"<CLS>Doctor, I have been experiencing hip pain, arm swelling and there is an excessive growth on my body. What could be the problem?<SEP>The extracted entities are Hip pain, Arm swelling, Excessive growth on body<EOS>\", \"answer_output\": \"<CLS>Based on your symptoms, it seems like you are suffering from necrotizing fasciitis, a serious bacterial skin infection that destroys skin and muscle tissues. It is important to seek immediate medical attention as it can be life-threatening.<SEP>The extracted entities are Necrotizing fasciitis, Bacterial skin infection, Skin and muscle tissue destruction, Life-threatening condition<EOS>\"}\n"]